[Language]
Name=Magyar (Hungarian)
Translator=Bluestar



; Strings in this section are used in several places of the plugin
[Common]
Yes=Igen
No=Nem

StateRunning=Fut
StateStopped=Leállítva
StatePaused=Szüneteltetve
StatePausePending=Szüneltetés függőben
StateContinuePending=Folytatás függőben
StateStartPending=Indítás függőben
StateStopPending=Leállítás függőben

StartupAutomaticDelayed=Automatikus (késleltetett)
StartupAutomatic=Automatikus
StartupManual=Manuális
StartupDisabled=Letiltva

; Some Actions
ActionStarting=%s indítása
ActionStopping=%s leállítása
ActionPausing=%s szüneteltetése

; Remote Computer Management
RemoteComputer=Távoli számítógép
AddRemoteComputer=Hozzáadás



; Strings in this section are used when
; a service "file" is viewed with F3
[GetFile]
ComputerName=Számítógép neve
ServiceName=Szolgáltatás neve
DisplayName=Megjelenítési név
Description=Leírás
BinaryPath=Elérési út
StartupType=Indítás típusa
State=Állapot
DesktopInteraction=Asztal interakció
OwnProcess=Saját folyamata van
LogonAs=Bejelentkezés mint
RequiredPrivileges=Szükséges jogosultságok



; Strings in this section are used when the service's
; properties are opened, i.e. (Alt+)Enter is pressed
[fmSvcProperties]
fmSvcProperties=%s tulajdonságai

; Some common form components
btnOK=OK
btnCancel=Mégsem
btnApply=&Alkalmaz
tsGeneral=Általános
tsAdvanced=Haladó
tsDependencies=Függőségek

; TabSheet General
lblServiceName=Szolgáltatás neve:
lblDisplayName=Megjelenítési &név:
lblDescription=&Leírás:
lblBinaryPath=&Elérési út:
lblStartupType=Indítás &típusa
lblState=Állapot:
popupExecutableShowProperties=Futtatható állomány &tulajdonságai
popupExecutableViewInSeparateLister=Futtatható állomány megtekintése TC &Nézőkében (különálló folyamat)

btnStart=&Indítás
btnPause=&Szüneteltetés
btnStop=&Leállítás
btnRestart=&Újraindítás
; Please don't make a keyboard shortcut for the delete button!
btnDelete=Törlés
lblQueryError=Megjegyzés: Hiba történt a szervíz konfiguráció lekérdezése közben (hibakód: %d). A szervízről adott információk hiányosak és/vagy helytelenek lehetnek!

; TabSheet Advanced
lblLogonAs=Bejelentkezés mint:
lblPassword=&Jelszó:
lblPasswordConfirm=Jelszó &megerősítése:
lblErrorControl=&Hibavezérlés:
checkInteractive=Engedélyezze a szolgáltatásnak az asztallal történő &interakciót
checkOwnProcess=A szolgáltatás &saját folyamatban fut
radioLocalSystem=&Helyi rendszer fiók
radioLocalService=Helyi &szolgáltatás fiók
radioThisAccount=&Ez a fiók:
radioNetworkService=&Hálózati szolgáltatás fiók
comboErrorControl=Kihagyás\nNormál\nSúlyos\nKritikus
btnBrowse=&Tallózás...
checkWow64=A szervíz WOW64 (32 bites szervíz 64 bites Windows alatt)
btnLaunchMMC=&MMC Snap-in elindítása (services.msc) ezen a számítógépen

; TabSheet Dependencies
lblDependent=%s ez által szükséges:
lblDependencies=%s a következő szolgáltatásoktól függ:
TypeDriver=[Vezérlő]
TypeGroup=[Csoport]

; Messages in TabSheet Dependencies
MsgNoDependencies=Nincs függőség
MsgWarn1=Figyelem: Az összes függőség nem állapítható meg!
MsgWarn2=Legvalószínűbb ok: hiányzó adminisztratív jogosultságok.

; Dialogs
DlgDeleteText=Tényleg törölni szeretnéd a következőt: %s?
DlgDeleteTitle=%s törlése?

DlgDependentsRunning1=Amikor %s leáll, az alábbi szolgáltatások is leállnak.
DlgDependentsRunning2=Le szeretnéd állítani ezeket a szolgáltatásokat?

DlgDependenciesStopped1=Amikor %s elindul, az alábbi szolgáltatások is elindulnak.
DlgDependenciesStopped2=El szeretnéd indítani ezeket a szolgáltatásokat?

DlgConfirmAddAccountRight=A szolgáltatás "%s"-ként történő futtatásához a fiók számára "Bejelentkezés szolgáltatásként" (%s) jogosultságot kell adnod.\n\nFolytatod?
DlgAccountRightAdded=Meg lett adva a jogosultság a(z) "%s" fiók számára.
DlgAccountRightNotAdded=Hiba a jogosultság "%s" számára történő adásakor!\nA hibaüzenet: %s (%u).
DlgPasswordsDiffer=A jelszavak nem egyeznek!
DlgInvalidAccount=A megadott fióknév nem érvényes!



[fmPluginSettings]
fmPluginSettings=Beállítások
lblLanguage=&Nyelv:
checkShowState=&Folyamat állapotának mutatása a TC panel kiterjesztés mezőjében
checkClassicTreeStyle=&Klasszikus stílus használata a függőségi fáknál
checkShowSvcNameAsName=Szervíz folyamat nevének mutatása a megjelenítési név helyett a TC panelen
checkAllowDeleteInPanel=&Szolgáltatások törlésének engedélyezése a TC panelen belül
checkLoadCustomColumns=&Egyéni Oszlop Nézet betöltése a beépülőbe történő belépéskor
lblClassicTreeStyle=Plusz/mínusz jelek használata a háromszögek helyett (Vista+)
checkEnableRemoteManagement=Távoli Számítógép &Vezérlés
checkToolsShowIcons=&Ikonok mutatása a belső/külső eszközöknél
checkAddSvcNameToDependencyTrees=Szervíz nevének mutatása a &függőségi fáknál
lblIniLocation=A beépülő &konfigurációs fájljának helye:
btnOK=OK
btnCancel=Mégsem
DlgReloadSettings=A plugin beállításainak újratöltéséhez kattints az OK-ra ha kész vagy a módosításokkal.

[fmAddRemoteComputer]
fmAddRemoteComputer=Távoli számítógép hozzáadása
lblComputerName=&Távoli számítógép neve:
btnBrowse=&Tallózás...
btnOK=&Hozzáadás
btnCancel=Mégsem
DlgSelectComputer=Válaszd ki a listához hozzáadandó számítógépet
